// Напишите программу, которая на вход принимает число и выдает, является ли число четным (делится ли оно на 2 без остатка)
Console.Write("Введите число"); 
int number = Convert.ToInt32(Console.ReadLine()); 
if number % = 0
{
    Console.WriteLine("Это число - четное");
    else
    {
        Console.WriteLine("Это число нечетное");
    }
}
