// Написать программу, которая на вход принимает число N, а на выходе показывает все четные числа от 1 до N (то есть N% 2 = 0)
Console.Write("Введите число"); 
int N = Convert.ToInt32(Console.ReadLine());
Array.Length = int N;
int Array = [1, N];
Count = 0;
while(Count < Array.Lenght)
{
    Count++;
    if(N% 2 = 0)
    return N;
}